Tekla Open API Reference for Tekla Structures 2025
WpfMaterialCatalog Constructor
Overload List
Name | Description
WpfMaterialCatalog()
 Initiates a new instance of the control.
WpfMaterialCatalog(String)
 Creates a new instance of the MaterialCatalog and will select the material (if available) in the tree.
Top
See Also
Reference
WpfMaterialCatalog Class
Tekla.Structures.Dialog.UIControls Namespace